Missing Data

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
data = Series(['2','3',np.nan,'four'])
data

0       2
1       3
2     NaN
3    four
dtype: object

In [3]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
data.dropna()

0       2
1       3
3    four
dtype: object

In [5]:
dframe = DataFrame([[1,3,5],[np.nan,7,8],[9,np.nan,10],[np.nan,np.nan,np.nan]])
dframe

     0    1     2
0  1.0  3.0   5.0
1  NaN  7.0   8.0
2  9.0  NaN  10.0
3  NaN  NaN   NaN

In [6]:
clean_dframe = dframe.dropna()

In [7]:
clean_dframe

     0    1    2
0  1.0  3.0  5.0

In [8]:
dframe.dropna(how='all')

     0    1     2
0  1.0  3.0   5.0
1  NaN  7.0   8.0
2  9.0  NaN  10.0

In [9]:
dframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [10]:
npn = np.nan

dframe2 = DataFrame([[1,2,3,npn],[2,npn,6,npn],[npn,7,npn,9],[1,npn,npn,npn]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  6.0  NaN
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [11]:
dframe2.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  6.0  NaN
2  NaN  7.0  NaN  9.0

In [12]:
dframe2.dropna(thresh=3)

     0    1    2   3
0  1.0  2.0  3.0 NaN

In [13]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  6.0  NaN
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [15]:
dframe.fillna(1)

     0    1     2
0  1.0  3.0   5.0
1  1.0  7.0   8.0
2  9.0  1.0  10.0
3  1.0  1.0   1.0

In [16]:
dframe2.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  6.0  1.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [17]:
dframe2.fillna({0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  6.0  3.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [18]:
dframe2.fillna(0)

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  6.0  0.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

In [19]:
dframe2.fillna(0,inplace=True)

In [20]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  6.0  0.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

Index Hierarchy

In [21]:
from numpy.random import randn

In [22]:
ser = Series(randn(8),index=[[1,1,1,2,2,2,3,3],['a','b','c','a','b','c','a','b']])
ser

1  a   -0.179809
   b    0.067998
   c   -0.987063
2  a   -2.269880
   b   -0.531005
   c    1.878309
3  a    0.292114
   b   -0.748705
dtype: float64

In [23]:
ser.index

MultiIndex(levels=[[1, 2, 3], [u'a', u'b', u'c']],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2], [0, 1, 2, 0, 1, 2, 0, 1]])

In [24]:
ser[3]

a    0.292114
b   -0.748705
dtype: float64

In [25]:
ser[2]

a   -2.269880
b   -0.531005
c    1.878309
dtype: float64

In [27]:
ser[:,'a']

1   -0.179809
2   -2.269880
3    0.292114
dtype: float64

In [28]:
ser[:,'c']

1   -0.987063
2    1.878309
dtype: float64

In [29]:
dframe = ser.unstack()
dframe

          a         b         c
1 -0.179809  0.067998 -0.987063
2 -2.269880 -0.531005  1.878309
3  0.292114 -0.748705       NaN

In [31]:
dframe3 = DataFrame(np.arange(36).reshape(6,6),index=[['a','a','b','b','c','c'],[1,2,1,2,1,3]],
                   columns=[['NYC','LA','SA','POL','KLO','UTA'],['cold','hot','breathtakimg','fog','hot','cold']])
dframe3

     NYC  LA           SA POL KLO  UTA
    cold hot breathtakimg fog hot cold
a 1    0   1            2   3   4    5
  2    6   7            8   9  10   11
b 1   12  13           14  15  16   17
  2   18  19           20  21  22   23
c 1   24  25           26  27  28   29
  3   30  31           32  33  34   35

In [32]:
dframe3.index.names = ['INDEX_1','INDEX_2']
dframe3.columns.names = ['Cities','weather']
dframe3

Cities           NYC  LA           SA POL KLO  UTA
weather         cold hot breathtakimg fog hot cold
INDEX_1 INDEX_2
a       1          0   1            2   3   4    5
        2          6   7            8   9  10   11
b       1         12  13           14  15  16   17
        2         18  19           20  21  22   23
c       1         24  25           26  27  28   29
        3         30  31           32  33  34   35

In [33]:
dframe3.swaplevel('Cities','weather',axis=1)

weather         cold hot breathtakimg fog hot cold
Cities           NYC  LA           SA POL KLO  UTA
INDEX_1 INDEX_2
a       1          0   1            2   3   4    5
        2          6   7            8   9  10   11
b       1         12  13           14  15  16   17
        2         18  19           20  21  22   23
c       1         24  25           26  27  28   29
        3         30  31           32  33  34   35

In [35]:
dframe3.sortlevel(1)

AttributeError: 'DataFrame' object has no attribute 'sortlevel'

In [36]:
dframe3.sort_index(1)

Cities          KLO  LA  NYC POL           SA  UTA
weather         hot hot cold fog breathtakimg cold
INDEX_1 INDEX_2
a       1         4   1    0   3            2    5
        2        10   7    6   9            8   11
b       1        16  13   12  15           14   17
        2        22  19   18  21           20   23
c       1        28  25   24  27           26   29
        3        34  31   30  33           32   35

In [39]:
dframe3.sort_index(0)

Cities           NYC  LA           SA POL KLO  UTA
weather         cold hot breathtakimg fog hot cold
INDEX_1 INDEX_2
a       1          0   1            2   3   4    5
        2          6   7            8   9  10   11
b       1         12  13           14  15  16   17
        2         18  19           20  21  22   23
c       1         24  25           26  27  28   29
        3         30  31           32  33  34   35

In [45]:
dframe3.sum(level='weather',axis=1)

weather          cold  hot  breathtakimg  fog
INDEX_1 INDEX_2
a       1           5    5             2    3
        2          17   17             8    9
b       1          29   29            14   15
        2          41   41            20   21
c       1          53   53            26   27
        3          65   65            32   33